<?php

// & をつけると参照渡しになる
$a1 = "WILLIAM";
$a2 = "henry";
$a3 = "gatES";

// 元の文字列を表示
echo $a1 . " " . $a2 . " " . $a3 . "<br>";

// 関数を呼び出す
fix_names($a1, $a2, $a3);

// 変更後の文字列を表示
echo $a1 . " " . $a2 . " " . $a3 . "<br>";

// 参照渡し: & をつけると参照渡しになる
// 値を直接変更する関数
// 返り値はない
// 参照渡しは値を返さない
// 値を直接変更したいときに使う
// 返り値を返す場合は、参照渡しをやめる
// 参照渡しは値を返さないので、関数を呼び出した後に値を表示する場合は、参照渡しをやめる


function fix_names(&$n1, &$n2, &$n3)
// $n1に&をつけることで参照渡しになる
// $n1は呼び出し元の変数と紐づく
// 値を直接変更する関数
{
    // すべて小文字にしてから最初の文字を大文字にする
    $n1 = ucfirst(strtolower($n1));
    $n2 = ucfirst(strtolower($n2));
    $n3 = ucfirst(strtolower($n3));
}
